Revit 2026 API

# IntersectionResultEdgeParameter Property

---

Parameter of a point on the edge closest to the point of intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double EdgeParameter { get; }
```
```vb
Public ReadOnly Property EdgeParameter As Double
	Get
```
```cpp
public:
property double EdgeParameter {
	double get ();
}
```
```fsharp
member EdgeParameter : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace